etp-backend/src/test/resources/legacy-api/esimerkki-2018.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body>
<p:EnergiatodistusIlmoitus xmlns:p="http://www.energiatodistusrekisteri.fi/ws/energiatodistustypes-2018" xmlns:vakiot="http://www.energiatodistusrekisteri.fi/ws/energiatodistustypes/vakiot" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.energiatodistusrekisteri.fi/ws/energiatodistustypes https://beta.energiatodistusrekisteri.fi/ws/etpservice?xsd=1">
  <p:Energiatodistus>
    <p:Perustiedot>
      <p:Nimi>Kilpikonna</p:Nimi>
      <p:Rakennustunnus>1010992249</p:Rakennustunnus>
      <p:Kiinteistotunnus>56</p:Kiinteistotunnus>
      <p:Katuosoite_Fi>Koivutie 11</p:Katuosoite_Fi>
      <p:Katuosoite_Sv>Elgväg 11</p:Katuosoite_Sv>
      <p:Postinumero>00100</p:Postinumero>
      <p:OnkoJulkinenRakennus>true</p:OnkoJulkinenRakennus>
      <p:Laatimisvaihe>0</p:Laatimisvaihe>
      <p:Havainnointikaynti>2017-10-10</p:Havainnointikaynti>
      <p:Rakennusosa>p:Rakennusosa</p:Rakennusosa>
      <p:Valmistumisvuosi>2001</p:Valmistumisvuosi>
      <p:Kayttotarkoitus>A</p:Kayttotarkoitus>
      <p:Kieli>2</p:Kieli>
      <p:Tilaaja>p:Tilaaja</p:Tilaaja>
      <p:Yritys>
      	<p:Nimi>p:Yritys</p:Nimi>
		<p:Katuosoite>p:YritysKatuosoite</p:Katuosoite>
		<p:Postinumero>00100</p:Postinumero>
		<p:Postitoimipaikka>p:Postitoimipaikka</p:Postitoimipaikka>
      </p:Yritys>
      <p:KeskeisetSuositukset_Fi>p:KeskeisetSuositukset</p:KeskeisetSuositukset_Fi>
    </p:Perustiedot>
    <p:Lahtotiedot>
      <p:LammitettyNettoala>15.0</p:LammitettyNettoala>
      <p:LahtotiedotRakennusvaippa>
        <p:Ilmanvuotoluku>0.5</p:Ilmanvuotoluku>
        <p:RvUlkoseinat>
          <p:RvA>0.5</p:RvA>
          <p:RvU>0.5</p:RvU>
        </p:RvUlkoseinat>
        <p:RvYlapohja>
          <p:RvA>0.5</p:RvA>
          <p:RvU>0.5</p:RvU>
        </p:RvYlapohja>
        <p:RvAlapohja>
          <p:RvA>0.5</p:RvA>
          <p:RvU>0.5</p:RvU>
        </p:RvAlapohja>
        <p:RvIkkunat>
          <p:RvA>0.5</p:RvA>
          <p:RvU>0.5</p:RvU>
        </p:RvIkkunat>
        <p:RvUlkoovet>
          <p:RvA>0.5</p:RvA>
          <p:RvU>0.5</p:RvU>
        </p:RvUlkoovet>
        <p:RvKylmasillatUA>0.5</p:RvKylmasillatUA>
      </p:LahtotiedotRakennusvaippa>
      <p:LahtotiedotIkkunat>
        <p:Pohjoinen>
          <p:IkkA>0.5</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Pohjoinen>
        <p:Koillinen>
          <p:IkkA>0.5</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Koillinen>
        <p:Ita>
          <p:IkkA>0.5</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Ita>
        <p:Kaakko>
          <p:IkkA>0.5</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Kaakko>
        <p:Etela>
          <p:IkkA>0.5</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Etela>
        <p:Lounas>
          <p:IkkA>0.5</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Lounas>
        <p:Lansi>
          <p:IkkA>0.5</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Lansi>
        <p:Luode>
          <p:IkkA>0.5</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Luode>
      </p:LahtotiedotIkkunat>
      <p:LahtotiedotIlmanvaihto>
        <p:IvKuvaus_Fi>p:IvKuvaus</p:IvKuvaus_Fi>
        <p:IvPaaivTulo>0.5</p:IvPaaivTulo>
        <p:IvPaaivPoisto>0.5</p:IvPaaivPoisto>
        <p:IvPaaivSfp>0.5</p:IvPaaivSfp>
        <p:IvPaaivLampotilasuhde>0.5</p:IvPaaivLampotilasuhde>
        <p:IvPaaivJaatymisenesto>0.5</p:IvPaaivJaatymisenesto>
        <p:IvErillispoistotTulo>0.5</p:IvErillispoistotTulo>
        <p:IvErillispoistotPoisto>0.5</p:IvErillispoistotPoisto>
        <p:IvErillispoistotSfp>0.5</p:IvErillispoistotSfp>
        <p:IvIvjarjestelmaTulo>0.5</p:IvIvjarjestelmaTulo>
        <p:IvIvjarjestelmaPoisto>0.5</p:IvIvjarjestelmaPoisto>
        <p:IvIvjarjestelmaSfp>0.5</p:IvIvjarjestelmaSfp>
        <p:IvLtoVuosihyotysuhde>0.5</p:IvLtoVuosihyotysuhde>
      </p:LahtotiedotIlmanvaihto>
      <p:LahtotiedotLammitys>
        <p:LammitysKuvaus_Fi>p:LammitysKuvaus</p:LammitysKuvaus_Fi>
        <p:LammitysTilatJaIv>
          <p:TuotonHyotysuhde>0.5</p:TuotonHyotysuhde>
          <p:JaonHyotysuhde>0.5</p:JaonHyotysuhde>
          <p:Lampokerroin>4</p:Lampokerroin>
          <p:Apulaitteet>0.5</p:Apulaitteet>
        </p:LammitysTilatJaIv>
        <p:LammitysLamminKayttovesi>
          <p:TuotonHyotysuhde>0.5</p:TuotonHyotysuhde>
          <p:JaonHyotysuhde>0.5</p:JaonHyotysuhde>
          <p:Lampokerroin>0.5</p:Lampokerroin>
          <p:Apulaitteet>0.5</p:Apulaitteet>
        </p:LammitysLamminKayttovesi>
        <p:LammitysTakka>
          <p:Maara>1</p:Maara>
          <p:Tuotto>0.5</p:Tuotto>
        </p:LammitysTakka>
        <p:LammitysIlmanlampopumppu>
          <p:Maara>1</p:Maara>
          <p:Tuotto>0.5</p:Tuotto>
        </p:LammitysIlmanlampopumppu>
      </p:LahtotiedotLammitys>
      <p:LahtotiedotJaahdytysjarjestelma>
        <p:JaahdytysjarjestelmaJaahdytyskaudenPainotettuKylmakerroin>1.5</p:JaahdytysjarjestelmaJaahdytyskaudenPainotettuKylmakerroin>
      </p:LahtotiedotJaahdytysjarjestelma>
      <p:LahtotiedotLkvnKaytto>
        <p:LkvnKayttoKulutusPerNelio>0.5</p:LkvnKayttoKulutusPerNelio>
        <p:LkvnKayttoVuosikulutus>0.5</p:LkvnKayttoVuosikulutus>
      </p:LahtotiedotLkvnKaytto>
      <p:LahtotiedotSisKuormat>
        <p:SisKuorma>
          <p:Selite_Fi>p:Selite</p:Selite_Fi>
          <p:Kayttoaste>0.3</p:Kayttoaste>
          <p:Henkilot>4.0</p:Henkilot>
          <p:Kuluttajalaitteet>4.0</p:Kuluttajalaitteet>
          <p:Valaistus>14.0</p:Valaistus>
        </p:SisKuorma>
        <p:SisKuorma>
          <p:Selite_Fi>p:Selite</p:Selite_Fi>
          <p:Kayttoaste>0.3</p:Kayttoaste>
          <p:Henkilot>4.0</p:Henkilot>
          <p:Kuluttajalaitteet>4.0</p:Kuluttajalaitteet>
          <p:Valaistus>14.0</p:Valaistus>
        </p:SisKuorma>
        <p:SisKuorma>
          <p:Selite_Fi>p:Selite</p:Selite_Fi>
          <p:Kayttoaste>0.3</p:Kayttoaste>
          <p:Henkilot>4.0</p:Henkilot>
          <p:Kuluttajalaitteet>4.0</p:Kuluttajalaitteet>
          <p:Valaistus>14.0</p:Valaistus>
        </p:SisKuorma>
      </p:LahtotiedotSisKuormat>
    </p:Lahtotiedot>
    <p:Tulokset>
      <p:TuloksetKaytettavatEnergiamuodot>
        <p:KaytettavaEnergiamuoto>
		  <p:EnergiamuotoVakio>fossiilinen polttoaine</p:EnergiamuotoVakio>
          <p:LaskettuOstoenergia>5000</p:LaskettuOstoenergia>
        </p:KaytettavaEnergiamuoto>
		<p:KaytettavaEnergiamuoto>
		  <p:EnergiamuotoVakio>kaukojäähdytys</p:EnergiamuotoVakio>
          <p:LaskettuOstoenergia>10.5</p:LaskettuOstoenergia>
        </p:KaytettavaEnergiamuoto>
         <p:KaytettavaEnergiamuoto>
		  <p:EnergiamuotoVakio>kaukolämpö</p:EnergiamuotoVakio>
          <p:LaskettuOstoenergia>0.5</p:LaskettuOstoenergia>
        </p:KaytettavaEnergiamuoto>
        <p:KaytettavaEnergiamuoto>
		  <p:EnergiamuotoVakio>sähkö</p:EnergiamuotoVakio>
          <p:LaskettuOstoenergia>0.5</p:LaskettuOstoenergia>
        </p:KaytettavaEnergiamuoto>
        <p:KaytettavaEnergiamuoto>
		  <p:EnergiamuotoVakio>uusiutuva polttoaine</p:EnergiamuotoVakio>
          <p:LaskettuOstoenergia>0.5</p:LaskettuOstoenergia>
        </p:KaytettavaEnergiamuoto>
      </p:TuloksetKaytettavatEnergiamuodot>
      <p:TuloksetUusiutuvatOmavaraisenergiat>
        <p:UusiutuvaOmavaraisenergia>
          <p:NimiVakio>aurinkolampo</p:NimiVakio>
          <p:Vuosikulutus>110.5</p:Vuosikulutus>
        </p:UusiutuvaOmavaraisenergia>
        <p:UusiutuvaOmavaraisenergia>
          <p:NimiVakio>aurinkosahko</p:NimiVakio>
          <p:Vuosikulutus>30.5</p:Vuosikulutus>
        </p:UusiutuvaOmavaraisenergia>
        <p:UusiutuvaOmavaraisenergia>
          <p:NimiVakio>tuulisahko</p:NimiVakio>
          <p:Vuosikulutus>50.5</p:Vuosikulutus>
        </p:UusiutuvaOmavaraisenergia>
        <p:UusiutuvaOmavaraisenergia>
          <p:NimiVakio>lampopumppu</p:NimiVakio>
          <p:Vuosikulutus>60.5</p:Vuosikulutus>
        </p:UusiutuvaOmavaraisenergia>
        <p:UusiutuvaOmavaraisenergia>
          <p:NimiVakio>muusahko</p:NimiVakio>
          <p:Vuosikulutus>20.5</p:Vuosikulutus>
        </p:UusiutuvaOmavaraisenergia>
      </p:TuloksetUusiutuvatOmavaraisenergiat>
      <p:TuloksetTeknisetJarjestelmat>
        <p:TjTilojenLammitys xsi:type="p:LammitysSahkoLampoType">
          <p:Sahko>0.5</p:Sahko>
          <p:Lampo>0.5</p:Lampo>
        </p:TjTilojenLammitys>
        <p:TjTuloilmanLammitys xsi:type="p:LammitysSahkoLampoType">
          <p:Sahko>0.5</p:Sahko>
          <p:Lampo>0.5</p:Lampo>
        </p:TjTuloilmanLammitys>
        <p:TjKayttovedenValmistus>
          <p:Sahko>0.5</p:Sahko>
          <p:Lampo>0.5</p:Lampo>
          <p:Kaukojaahdytys>0.5</p:Kaukojaahdytys>
        </p:TjKayttovedenValmistus>
        <p:TjIvSahko>0.5</p:TjIvSahko>
        <p:TjJaahdytys>
          <p:Sahko>0.5</p:Sahko>
          <p:Lampo>0.5</p:Lampo>
          <p:Kaukojaahdytys>0.5</p:Kaukojaahdytys>
        </p:TjJaahdytys>
        <p:TjKuluttajalaitteetJaValaistusSahko>0.5</p:TjKuluttajalaitteetJaValaistusSahko>
      </p:TuloksetTeknisetJarjestelmat>
      <p:TuloksetNettotarve>
        <p:NtTilojenLammitysVuosikulutus>0.5</p:NtTilojenLammitysVuosikulutus>
        <p:NtIlmanvaihdonLammitysVuosikulutus>0.5</p:NtIlmanvaihdonLammitysVuosikulutus>
        <p:NtKayttovedenValmistusVuosikulutus>0.5</p:NtKayttovedenValmistusVuosikulutus>
        <p:NtJaahdytysVuosikulutus>0.5</p:NtJaahdytysVuosikulutus>
      </p:TuloksetNettotarve>
      <p:TuloksetLampokuormat>
        <p:LkAurinko>0.3</p:LkAurinko>
        <p:LkIhmiset>4</p:LkIhmiset>
        <p:LkKuluttajalaitteet>4</p:LkKuluttajalaitteet>
        <p:LkValaistus>14</p:LkValaistus>
        <p:LkKvesi>0.5</p:LkKvesi>
      </p:TuloksetLampokuormat>
      <p:TuloksetLaskentatyokalu>p:TuloksetLaskentatyokalu</p:TuloksetLaskentatyokalu>
    </p:Tulokset>
    <p:ToteutunutOstoenergiankulutus>
      <p:OstettuEnergia>
        <p:ToKaukolampoVuosikulutus>0.5</p:ToKaukolampoVuosikulutus>
        <p:ToKokonaissahkoVuosikulutus>0.5</p:ToKokonaissahkoVuosikulutus>
        <p:ToKiinteistosahkoVuosikulutus>0.5</p:ToKiinteistosahkoVuosikulutus>
        <p:ToKayttajasahkoVuosikulutus>0.5</p:ToKayttajasahkoVuosikulutus>
        <p:ToKaukojaahdytysVuosikulutus>0.5</p:ToKaukojaahdytysVuosikulutus>
      </p:OstettuEnergia>
      <p:OstetutPolttoaineet>
        <p:OpKevytPolttooljy>0.5</p:OpKevytPolttooljy>
        <p:OpPilkkeetHavuSekapuu>0.5</p:OpPilkkeetHavuSekapuu>
        <p:OpPilkkeetKoivu>0.5</p:OpPilkkeetKoivu>
        <p:OpPuupelletit>0.5</p:OpPuupelletit>
      </p:OstetutPolttoaineet>
      <p:ToSahkoVuosikulutusYhteensa>0.5</p:ToSahkoVuosikulutusYhteensa>
      <p:ToKaukolampoVuosikulutusYhteensa>0.5</p:ToKaukolampoVuosikulutusYhteensa>
      <p:ToPolttoaineetVuosikulutusYhteensa>0.5</p:ToPolttoaineetVuosikulutusYhteensa>
      <p:ToKaukojaahdytysVuosikulutusYhteensa>0.5</p:ToKaukojaahdytysVuosikulutusYhteensa>
    </p:ToteutunutOstoenergiankulutus>
    <p:Huomiot>
      <p:HuomiotYmparys>
        <p:HuomiotTeksti_Fi>p:HuomiotTeksti</p:HuomiotTeksti_Fi>
        <p:Toimenpide>
		<p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Lampo>0.5</p:Lampo>
          <p:Sahko>0.5</p:Sahko>
          <p:Jaahdytys>0.5</p:Jaahdytys>
          <p:EluvunMuutos>0.5</p:EluvunMuutos>
        </p:Toimenpide>
      </p:HuomiotYmparys>
      <p:HuomiotAlapohjaYlapohja>
        <p:HuomiotTeksti_Fi>p:HuomiotTeksti</p:HuomiotTeksti_Fi>
        <p:Toimenpide>
			<p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
			<p:Lampo>0.5</p:Lampo>
			<p:Sahko>0.5</p:Sahko>
			<p:Jaahdytys>0.5</p:Jaahdytys>
			<p:EluvunMuutos>0.5</p:EluvunMuutos>
        </p:Toimenpide>
      </p:HuomiotAlapohjaYlapohja>
      <p:HuomiotLammitys>
        <p:HuomiotTeksti_Fi>p:HuomiotTeksti</p:HuomiotTeksti_Fi>
        <p:Toimenpide>
		<p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Lampo>0.5</p:Lampo>
          <p:Sahko>0.5</p:Sahko>
          <p:Jaahdytys>0.5</p:Jaahdytys>
          <p:EluvunMuutos>0.5</p:EluvunMuutos>
        </p:Toimenpide>
      </p:HuomiotLammitys>
      <p:HuomiotIvIlmastointi>
        <p:HuomiotTeksti_Fi>p:HuomiotTeksti</p:HuomiotTeksti_Fi>
        <p:Toimenpide>
		<p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Lampo>0.5</p:Lampo>
          <p:Sahko>0.5</p:Sahko>
          <p:Jaahdytys>0.5</p:Jaahdytys>
          <p:EluvunMuutos>0.5</p:EluvunMuutos>
        </p:Toimenpide>
      </p:HuomiotIvIlmastointi>
      <p:HuomiotValaistusMuut>
        <p:HuomiotTeksti_Fi>p:HuomiotTeksti</p:HuomiotTeksti_Fi>
        <p:Toimenpide>
		<p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Lampo>0.5</p:Lampo>
          <p:Sahko>0.5</p:Sahko>
          <p:Jaahdytys>0.5</p:Jaahdytys>
          <p:EluvunMuutos>0.5</p:EluvunMuutos>
        </p:Toimenpide>
      </p:HuomiotValaistusMuut>
      <p:HuomiotSuositukset_Fi>p:HuomiotSuositukset</p:HuomiotSuositukset_Fi>
      <p:HuomiotLisatietoja_Fi>p:HuomiotLisatietoja</p:HuomiotLisatietoja_Fi>
    </p:Huomiot>
    <p:Lisamerkintoja_Fi>p:Lisamerkintoja</p:Lisamerkintoja_Fi>
  </p:Energiatodistus>
</p:EnergiatodistusIlmoitus>
</S:Body></S:Envelope>
